Connect our Jupyter notebook to our database file.

In [1]:
%%capture
%load_ext sql
%sql sqlite:///factbook.db

'Connected: None@factbook.db'

Enable to run sql query then query database to get the table.

In [2]:
%%sql
SELECT *
  FROM facts
LIMIT 5;

Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92),
 (4, 'an', 'Andorra', 468, 468, 0, 85580, 0.12, 8.13, 6.96, 0.0),
 (5, 'ao', 'Angola', 1246700, 1246700, 0, 19625353, 2.78, 38.78, 11.49, 0.46)]

In [3]:
%%sql
SELECT MIN(population) AS min_popln, 
       MAX(population) AS max_popln, 
       MIN(population_growth) AS min_popln_growth,
       MAX(population_growth) AS max_popln_growth
  FROM facts;

Done.

[(0, 7256490011, 0.0, 4.02)]

From the results above we see that there is a country in which no one lives and another that has 7.2 billion people, essentially the whole world's population. Both of these results are suspect so we will take a closer look to determine the countries in question.

In [4]:
%%sql
SELECT name, MIN(population) AS min_popln
  FROM facts;

Done.

[('Antarctica', 0)]

In [5]:
%%sql
SELECT name, MAX(population) AS max_popln
  FROM facts;

Done.

[('World', 7256490011)]

Aha! We see that Antarctica was counted as having 0 population and the country with the highest population is actually the world's population. We'll redo our calculations excluding the value for the world.

In [6]:
%%sql
SELECT COUNT(name)
  FROM facts;

Done.

[(261,)]

There are 261 countries.

In [7]:
%%sql
SELECT MIN(population) AS min_popln, 
       MAX(population) AS max_popln, 
       MIN(population_growth) AS min_popln_growth,
       MAX(population_growth) AS max_popln_growth
  FROM facts
WHERE name <> 'World';

Done.

[(0, 1367485388, 0.0, 4.02)]

We see now that the country max is 1.367 billion.

In [8]:
%%sql
SELECT AVG(population) AS avg_popln, 
       AVG(area) AS avg_area
  FROM facts
WHERE name <> 'World';

Done.

[(32242666.56846473, 555093.546184739)]

In [17]:
%%sql
SELECT name, population, area
  FROM facts
WHERE area < (SELECT AVG(area) FROM facts)
AND population > (SELECT AVG(population) FROM facts)
ORDER BY population / area DESC;

Done.

[('Bangladesh', 168957745, 148460),
 ('Philippines', 100998376, 300000),
 ('Japan', 126919659, 377915),
 ('Vietnam', 94348835, 331210),
 ('United Kingdom', 64088222, 243610),
 ('Germany', 80854408, 357022),
 ('Thailand', 67976405, 513120)]

The table above is ordered by population density. Hence Bangladesh has the most people per area.